app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
    @muscles = Muscle.all
---
SELECT * FROM `exercises`
SELECT * FROM `muscles`

  def show
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 1)

  def new
    @exercise = Exercise.new
    @muscles = Muscle.all
---
SELECT * FROM `muscles`

  def edit
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 3)

  def create
    @exercise = Exercise.new(params[:exercise])

    respond_to do |format|
      if @exercise.save
---
INSERT INTO `exercises` (`name`, `updated_at`, `muscle_id`, `created_at`) VALUES('', '2010-03-12 23:22:00', 0, '2010-03-12 23:22:00')

  def update
    @exercise = Exercise.find(params[:id])

    respond_to do |format|
      if @exercise.update_attributes(params[:exercise])
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 5)
UPDATE `exercises` SET `muscle_id` = 1, `updated_at` = '2010-03-13 01:15:09' WHERE `id` = 5

  def destroy
    @exercise = Exercise.find(params[:id])
    @exercise.destroy
---
SELECT * FROM `exercises` WHERE (`exercises`.`id` = 1)
DELETE FROM `exercises` WHERE `id` = 1