app/controllers/lifts_controller.rb

  def index
    @lifts = Lift.all
    @exercises = Exercise.all
---
SELECT * FROM `lifts`
SELECT * FROM `exercises`

  def show
    @lift = Lift.find(params[:id])
---
SELECT * FROM `lifts` WHERE (`lifts`.`id` = 1)

  def new
    @lift = Lift.new
    @exercises = Exercise.all
---
SELECT * FROM `exercises`

  def create
    @lift = Lift.new(params[:lift])

    respond_to do |format|
      if @lift.save
---
INSERT INTO `lifts` (`updated_at`, `exercise_id`, `weight`, `user_id`, `created_at`) VALUES('2010-03-13 15:47:32', 1, 23, 1, '2010-03-13 15:47:32')