app/controllers/maxes_controller.rb

SELECT * FROM `maxes`
---
  def index
    @maxes = Max.all