app/controllers/muscles_controller.rb

  def index
    @muscles = Muscle.all
---
SELECT * FROM `muscles`

  def show
    @muscle = Muscle.find(params[:id])
---
SELECT * FROM `muscles` WHERE (`muscles`.`id` = 1)

  def edit
    @muscle = Muscle.find(params[:id])
---
SELECT * FROM `muscles` WHERE (`muscles`.`id` = 1)

  def create
    @muscle = Muscle.new(params[:muscle])

    respond_to do |format|
      if @muscle.save
---
INSERT INTO `muscles` (`name`, `updated_at`, `created_at`) VALUES('dfg', '2010-03-12 23:08:14', '2010-03-12 23:08:14')

  def update
    @muscle = Muscle.find(params[:id])

    respond_to do |format|
      if @muscle.update_attributes(params[:muscle])
---
SELECT * FROM `muscles` WHERE (`muscles`.`id` = 1)
UPDATE `muscles` SET `updated_at` = '2010-03-12 23:57:16', `name` = 'Chest\r\n' WHERE `id` = 1