app/controllers/reports_controller.rb

def progress
    @lifts = Lift.all
    @exercises = Exercise.all
---
SELECT * FROM `lifts`
SELECT * FROM `exercises`