app/controllers/weights_controller.rb

  def index
    @weights = Weight.all
---
SELECT * FROM `weights`